# Python Development Assignment

### Problem Statement
Clean, analyze and convert the given data file ‘data.json’  into 3 separate CSV Files according to the requirements given.

### Solution

#### Importing necessary libraries

In [1]:
import pandas as pd
import numpy as np
import json

In [2]:
# Importing JSON File

df = pd.read_json('data.json', lines=True)    #lines=True Reads the file as a json object per line
df.head()

,a,liid,linkedin,n,t,e
0,egypt,saleh-adoum-hamid-1646245a,https://www.linkedin.com/in/saleh-adoum-hamid-...,saleh hamid,NaN,NaN
1,"reading, reading, united kingdom",robbie-woods-2022894b,https://www.linkedin.com/in/robbie-woods-2022894b,robbie woods,NaN,NaN
2,"humble, texas, united states",billy-mckay-64217246,https://www.linkedin.com/in/billy-mckay-64217246,billy mckay,"[1-619-549-5428, 1-316-871-3930, 1-801-953-321...","[iluv2flie@yahoo.com, billy.mckay@gmail.com]"
3,"adelaide, south australia, australia",pat-sewell-546456b2,https://www.linkedin.com/in/pat-sewell-546456b2,pat sewell,NaN,NaN
4,chile,gustavo-valenzuela-olguin-62b5aaaa,https://www.linkedin.com/in/gustavo-valenzuela...,gustavo olguin,NaN,NaN

In [3]:
# Reanaming Columns

df_new = df.rename(columns={"a": "address", "liid": "profile_url","linkedin":"linkedin_id","n":"name","t":"mob_number","e":"email"})
df_new.head()

,address,profile_url,linkedin_id,name,mob_number,email
0,egypt,saleh-adoum-hamid-1646245a,https://www.linkedin.com/in/saleh-adoum-hamid-...,saleh hamid,NaN,NaN
1,"reading, reading, united kingdom",robbie-woods-2022894b,https://www.linkedin.com/in/robbie-woods-2022894b,robbie woods,NaN,NaN
2,"humble, texas, united states",billy-mckay-64217246,https://www.linkedin.com/in/billy-mckay-64217246,billy mckay,"[1-619-549-5428, 1-316-871-3930, 1-801-953-321...","[iluv2flie@yahoo.com, billy.mckay@gmail.com]"
3,"adelaide, south australia, australia",pat-sewell-546456b2,https://www.linkedin.com/in/pat-sewell-546456b2,pat sewell,NaN,NaN
4,chile,gustavo-valenzuela-olguin-62b5aaaa,https://www.linkedin.com/in/gustavo-valenzuela...,gustavo olguin,NaN,NaN

Here I am replacing the column names according to the question, and therefore changing names as required.

In [4]:
# Checking for Null Values

df_new.isnull().sum()

address         61
profile_url      0
linkedin_id      0
name             0
mob_number     966
email          654
dtype: int64

If the table had some column which had count of any entity, we would have replaced null values with 0, but here it is not required. So we will keep as it is.

#### Now saving into CSV files

In [6]:
# 1. data_main.csv: with columns: linkedin_id,address,profile_url,name
df_1 = df_new.drop(['mob_number','email'],axis=1)
df_1.head()

,address,profile_url,linkedin_id,name
0,egypt,saleh-adoum-hamid-1646245a,https://www.linkedin.com/in/saleh-adoum-hamid-...,saleh hamid
1,"reading, reading, united kingdom",robbie-woods-2022894b,https://www.linkedin.com/in/robbie-woods-2022894b,robbie woods
2,"humble, texas, united states",billy-mckay-64217246,https://www.linkedin.com/in/billy-mckay-64217246,billy mckay
3,"adelaide, south australia, australia",pat-sewell-546456b2,https://www.linkedin.com/in/pat-sewell-546456b2,pat sewell
4,chile,gustavo-valenzuela-olguin-62b5aaaa,https://www.linkedin.com/in/gustavo-valenzuela...,gustavo olguin

Here we dropped some columns as per requirements. We needed only 'address','profile_url','name' and 'linkedin_id' columns so we dropped the rest of the columns.

In [7]:
# Now converting df_1 to data_main.csv

df_1.to_csv('data_main.csv',index=False)  #index is kept as False because it creates another column for indexing

In [8]:
# And now similarly we will create data_email.csv

df_2 =  df_new.drop(['address','profile_url','name','mob_number'],axis=1)
df_2

,linkedin_id,email
0,https://www.linkedin.com/in/saleh-adoum-hamid-...,NaN
1,https://www.linkedin.com/in/robbie-woods-2022894b,NaN
2,https://www.linkedin.com/in/billy-mckay-64217246,"[iluv2flie@yahoo.com, billy.mckay@gmail.com]"
3,https://www.linkedin.com/in/pat-sewell-546456b2,NaN
4,https://www.linkedin.com/in/gustavo-valenzuela...,NaN
...,...,...
995,https://www.linkedin.com/in/cernoch-patricia-a...,NaN
996,https://www.linkedin.com/in/bengt-åke-holmströ...,NaN
997,https://www.linkedin.com/in/dobryi-andrey-1257...,NaN
998,https://www.linkedin.com/in/nishant-bhaskar-19...,NaN
999,https://www.linkedin.com/in/elaine-osbment-9b6...,[elaine.osbment@prowerscounty.net]

Here we dropped 'address','profile_url','name' and 'mob_number' columns as per the requirements.

In [9]:
# Now converting df_2 to data_email.csv

df_2.to_csv('data_email.csv',index=False)

In [11]:
# Similarly we do the same process for data_number.csv

df_3 = df_new.drop(['address','profile_url','name','email'],axis=1)
df_3.head()

,linkedin_id,mob_number
0,https://www.linkedin.com/in/saleh-adoum-hamid-...,NaN
1,https://www.linkedin.com/in/robbie-woods-2022894b,NaN
2,https://www.linkedin.com/in/billy-mckay-64217246,"[1-619-549-5428, 1-316-871-3930, 1-801-953-321..."
3,https://www.linkedin.com/in/pat-sewell-546456b2,NaN
4,https://www.linkedin.com/in/gustavo-valenzuela...,NaN

In [12]:
#Now converting df_2 to data_email.csv

df_3.to_csv('data_number.csv',index=False)